# GetAllUsedServices Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllUsedServices Method
FabricationConfiguration Class See Also
---
Returns all the used fabrication services. A service is used if any fabrication part in the service is created by user.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<FabricationService> GetAllUsedServices()
```

Visual Basic
---
```text
Public Function GetAllUsedServices As IList(Of FabricationService)
```

Visual C++
---
```text
public:
IList<FabricationService^>^ GetAllUsedServices()
```

# ### Return Value
All the used fabrication services.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace